#Очередь.
#взял в работу

#3.* Напишите функцию, которая "вращает" очередь по кругу на N элементов.

#4.* Реализуйте очередь с помощью двух стеков.

#5.* Добавьте функцию, которая обращает все элементы в очереди в обратном порядке.

#6.* Реализуйте круговую (циклическую буферную) очередь статическим массивом фиксированного размера. Добавьте ей метод проверки, полна ли она (при этом добавление новых элементов невозможно).
#Обеспечьте эффективное управление указателями начала и конца очереди в рамках массива, чтобы избежать неоправданных сдвигов данных. 
