# Очередь.
#1. В классе Queue нам понадобятся три метода: size() (количество элементов в очереди), enqueue(item) -- добавить элемент в хвост очереди, и dequeue(), 
#которая возвращает элемент из головы очереди, удаляя его. 

class Queue:
    def __init__(self):
        # инициализация хранилища данных

    def enqueue(self, item):
        # вставка в хвост

    def dequeue(self):
        # выдача из головы
        return None # если очередь пустая

    def size(self):
        return 0 # размер очереди

#2. Оцените меру сложности для операций enqueue() и dequeue().
